/*
ЦЫКЛЫ ===================================================
 
 while (условие) {
    тело цыкла;
 }
 
 do {
    тело цыкла;
 } while (условие);  ->  двнный цыкл выполнится хотя бы один раз.
 
 for (инициализация управляющей переменной [может не быть или быть несколько через запятую]; условие продолжения цыкла; изменение управляющей переменной [может не быть или быть несколько через запятую]) {
    тело цыкла;
 }
 
 for (int i = 0, i < 10, i++)  ->  цыкл for без тела.
    ;
 
 break  -  выходит из цыкла.
 continue  -  переходит к следующей итерации игнорируб все что после оператора continue.
 */

