/*
 СТУКТУРА ПАМЯТИ В СИ ===================================
 
 СТЕК (STACK)
 Принцып LIFO, переменные добавляются при вызове функции и удаляются при её завершении.
 Расположени в максимальных адресах и стремится к минемалтным.
 - локальные переменные
 
 
 КУЧА (HEAP)
 Память которрая управляется разработчиком
 
 
 ГЛОБАЛЬНЫЕ ПЕРЕМЕННЫЕ (GLOBAL VARIBLES)
 Переменные которые создаются при запуске программы и видны в любой её части.
 
 
 КОНСТАНТЫ (CONSTANTS)
 Константы создаются при запуске программы и помещаются в область памяти доступную только для чтения.
 - Любые строковые литералы
 
 
 КОД (CODE)
 Область для скомпелированного кода, так же доступна тольк для чтения.
 
 
 */

